Revit 2027 API
BuiltInFailures.SiteFailures.CannotIntersectSiteRegions Property
 Subregions cannot intersect.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotIntersectSiteRegions { get; }
Public Shared ReadOnly Property CannotIntersectSiteRegions As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotIntersectSiteRegions {
	FailureDefinitionId^ get ();
}
static member CannotIntersectSiteRegions : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SiteFailures Class
Autodesk.Revit.DB Namespace